
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 6 to change, 4 to destroy.</code></pre>

* Update
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.trigger_once


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.schedule must be replaced
-/+ resource "azurerm_automation_job_schedule" "schedule" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/ed5ad86b-961b-4211-8f47-a2494789f385" -> (known after apply)
      ~ job_schedule_id         = "ed5ad86b-961b-4211-8f47-a2494789f385" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "bypass_akv_network"   = "true" -> "false"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/ec4134b7-bd43-44b1-a6a1-7a4b039ce4e3" -> (known after apply)
      ~ job_schedule_id         = "ec4134b7-bd43-44b1-a6a1-7a4b039ce4e3" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "bypass_akv_network"   = "true" -> "false"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
      ~ start_time              = "2023-06-14T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
      ~ start_time              = "2023-06-13T11:14:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_job_schedule.schedule must be replaced
-/+ resource "azurerm_automation_job_schedule" "schedule" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/7271d8f2-ef99-4840-8069-a1a9d7386e59" -> (known after apply)
      ~ job_schedule_id         = "7271d8f2-ef99-4840-8069-a1a9d7386e59" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "bypass_akv_network"   = "true" -> "false"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_job_schedule.trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/22880369-9d23-497a-9f03-828de5eeb4df" -> (known after apply)
      ~ job_schedule_id         = "22880369-9d23-497a-9f03-828de5eeb4df" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "bypass_akv_network"   = "true" -> "false"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
      ~ start_time              = "2023-06-14T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
      ~ start_time              = "2023-06-13T11:14:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg|hmi-kv-stg"
        name                       = "hmi-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg-shared-rota|hmi-kv-stg-shared-rota"
        name                       = "hmi-kv-stg-shared-rota"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 6 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":20,"Program":"tfcmt","SHA1":"","Vars":{}} -->